#include "CMenu.h"

CMenu::CMenu()
{
}

CMenu::~CMenu()
{
}

void CMenu::ShowMenu()
{
	cout << "*******************************************" << endl;
	cout << "***********欢迎使用学生管理系统************" << endl;
	cout << "************1.退出学生管理系统*************" << endl;
	cout << "************2.输入学生课程记录*************" << endl;
	cout << "************3.查询学生考试情况*************" << endl;
	cout << "************4.删除学生课程记录*************" << endl;
	cout << "************5.修改学生课程记录*************" << endl;
	cout << "*******************************************" << endl;
}

void CMenu::ShowInsertMenu()
{
	cout << "************************************************" << endl;
	cout << "***** 1. 新增学生(ID, 名字) ********************" << endl;
	cout << "***** 2. 新增课程(ID, 名字) ********************" << endl;
	cout << "***** 3. 新增选课记录(学生ID, 课程ID, 分数)*****" << endl;
	cout << "***** 4. 返回上一层菜单*************************" << endl;
	cout << "************************************************" << endl;
}

void CMenu::ShowFindMenu()
{
	cout << "****************************************************" << endl;
	cout << "***** 1. 通过学生ID查询学生姓名 ********************" << endl;
	cout << "***** 2. 通过学生姓名查询学生ID ********************" << endl;
	cout << "***** 3. 通过课程ID查询课程名 **********************" << endl;
	cout << "***** 4. 通过课程名查询课程ID **********************" << endl;
	cout << "***** 5. 通过课程ID查询选修了该课程的学生以及成绩 **" << endl;
	cout << "***** 6. 通过学生ID查询该学生选修的课程信息 ********" << endl;
	cout << "***** 7. 通过课程名查询选修了该课程的学生以及成绩 **" << endl;
	cout << "***** 8. 返回上一层菜单*****************************" << endl;
	cout << "****************************************************" << endl;
}

void CMenu::ShowDelMenu()
{
	cout << "***************************************" << endl;
	cout << "***** 1. 删除学生(ID) *****************" << endl;
	cout << "***** 2. 删除课程(ID) *****************" << endl;
	cout << "***** 3. 删除选课记录(学生ID, 课程ID)**" << endl;
	cout << "***** 4. 返回上一层菜单****************" << endl;
	cout << "***************************************" << endl;
}

void CMenu::ShowUpdateMenu()
{
	cout << "****************************************" << endl;
	cout << "***** 1. 更改学生姓名 ******************" << endl;
	cout << "***** 2. 更改课程名称 ******************" << endl;
	cout << "***** 3. 更改选课分数*******************" << endl;
	cout << "***** 4. 返回上一层菜单*****************" << endl;
	cout << "****************************************" << endl;
}

void CMenu::ExitMenu()
{
	cout << "退出系统，欢迎下次使用" << endl;
	system("pause");
	exit(0);
}
